/*-----------------------------------------------------------------------------
 * Name: 025_Branch03
 * DESC: 조건문(if ~ else if ~ else)
 * 코드 자동 완성(Code Snippet): 키워드 + tab
 * 조건식을 이용하여 프로그램의 흐름을 제어
-----------------------------------------------------------------------------*/
#include<iostream>

using namespace std;

int main()
{
    int num = 100;

    if (num > 100)
    {
        cout << "num은 100보다 크다." << endl;
    }
    else if(num == 100)
    {
        cout << "num은 100이다." << endl;
    }
    else
    {
        cout << "num은 100보다 작다." << endl;
    }

    cout << "num: " << num << endl;

    return 0;
}

/* Result
짝수 입니다.
num은 100보다 작다.
num: 100
*/

/*
            *
          *   *
        *       *    (else if)
       *  조건1   * →→ FALSE ───────┐
        *       *                   ↓
          *   *                     ↓
            *                       *                                  
            ↓                     *   *
            ↓                   *       *     (else)
            ↓                  *  조건2   * →→ FALSE ── 거짓인 경우 실행 ───┐
            ↓                   *       *                                 ↓↓ 
            ↓                     *   *                                   ↓↓ 
            ↓                       *                                     ↓↓ 
            ↓                      ↓↓                                     ↓↓ 
            ↓                      ↓↓                                     ↓↓ 
           TRUE                   TRUE                                    ↓↓ 
            ↓↓                     ↓↓                                     ↓↓ 
            ↓↓                     ↓↓                                     ↓↓ 
       참인 경우 실행 ──────────────────────────────────────────→→→→→→→→→→→→→→→→→→

*/


// if(조건식1)
// {
//      조건식1이 TRUE(참) 실행
// }
// else if(조건식2)
// {
//      조건식2이 TRUE(참) 실행
// }
// else
// {
//      조건식2이 FALSE(거짓) 실행
// }